app/controllers/welcome_controller.rb

SELECT `cells`.* FROM `cells` WHERE `cells`.`Cell_ID` = 'NMLCL000005' LIMIT 1
---
substring=result[0..4]
puts"\n\n************"+substring
if substring ==  "NMLCL"
cell=Cell.find_by_Cell_ID(result.to_s)

SELECT `channels`.* FROM `channels` WHERE `channels`.`Channel_ID` = 'NMLCH000037' LIMIT 1
---
end

if substring == "NMLCH"
channel=Channel.find_by_Channel_ID(result.to_s)

SELECT `networks`.* FROM `networks` WHERE `networks`.`Network_ID` = 'NMLNT000001' LIMIT 1
---


if substring == "NMLNT"
network=Network.find_by_Network_ID(result.to_s)